// task 1 : Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
let t1 = '';

for (let i = 20; i < 30.5; i += 0.5) {
  t1 += `${i} `;
}
alert(`task 1: Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
${t1}`);

//task 2 : Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
let t2 = '';
let oneDollar = 27;

for (let i = 10; i < 101; i += 10) {
  let change = oneDollar * i;
  t2 += `${i} USD = ${change} UAH\n`;
}
alert(`task 2: Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
${t2}`);

// task 3 :Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
let t3num = +prompt(
  'task 3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.Введіть ціле число: '
);
let t3 = '';

for (let i = 1; i < 101; i++) {
  if (i ** 2 < t3num) {
    t3 += `${i} `;
  }
}
alert(`task 3: ${t3}`);

// task 4 : Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
let t4num = +prompt(
  "task 4. Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).Введіть ціле число: "
);

function isPrime(n) {
  for (let i = 2; i < n; i++) {
    if (n % i === 0) return false;
  }
  return n > 1;
}
alert(`task 4: ${isPrime(t4num)}`);

//task 5 : Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let t5num = +prompt(
  'task 5. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна). Введіть число: '
);

while (t5num % 3 == 0) {
  t5num /= 3;
}
alert(
  `task 5: ${t5num == 1 ? 'Число можна одеражати' : 'Число НЕ можна одержати'}`
);
