// task 1 : Вивести на сторінку в один рядок через кому числа від 10 до 20.
let t1 = '';

for (let i = 10; i < 21; i++) {
  if (i == 20) {
    t1 += `${i}`;
  } else {
    t1 += `${i},`;
  }
}
alert(`task 1: Вивести на сторінку в один рядок через кому числа від 10 до 20 
${t1}`);

// task 2 : Вивести квадрати чисел від 10 до 20.
let t2 = '';

for (let i = 10; i < 21; i++) {
  if (i == 20) {
    t2 += `${i ** 2}`;
  } else {
    t2 += `${i ** 2},`;
  }
}
alert(`task 2: Вивести квадрати чисел від 10 до 20.
${t2}`);

// task 3 : Вивести таблицю множення на 7.
let t3 = '';

for (let i = 1; i < 8; i++) {
  let mult = 7 * i;
  t3 += `7 * ${i} = ${mult}\n`;
}
alert(`task 3: Вивести таблицю множення на 7.
${t3}`);

// task 4 : Знайти суму всіх цілих чисел від 1 до 15.
let t4 = 0;

for (let i = 1; i < 16; i++) {
  t4 += i;
}
alert(`task 4: Знайти суму всіх цілих чисел від 1 до 15.
${t4}`);

// task 5 : Знайти добуток усіх цілих чисел від 15 до 35.
let t5 = 1;

for (let i = 15; i < 36; i++) {
  t5 *= i;
}
alert(`task 5: Знайти добуток усіх цілих чисел від 15 до 35.
${t5}`);

// task 6 : Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
let t6 = 0;

for (let i = 1; i < 501; i++) {
  t6 += i;
}

let res6 = t6 / 500;

alert(`task 6: Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
${res6}`);

// task 7 : Вивести суму лише парних чисел в діапазоні від 30 до 80.
let t7 = 0;

for (let i = 30; i < 81; i++) {
  if (i % 2 == 0) {
    t7 += i;
  }
}
alert(`task 7: Вивести суму лише парних чисел в діапазоні від 30 до 80.
${t7}`);

// task 8 : Вивести всі числа в діапазоні від 100 до 200 кратні 3.
t8 = '';

for (let i = 100; i < 201; i++) {
  if (i % 3 == 0) t8 += `${i} `;
}
alert(`task 8: Вивести всі числа в діапазоні від 100 до 200 кратні 3.
${t8}`);

// task 9 : Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
let t9num = +prompt('task 9. Введіть натуральне число: ');
let t9 = '';

for (let i = 0; i < t9num + 1; i++) {
  if (t9num % i == 0) {
    t9 += `${i} `;
  }
}
alert(`task 9: Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
${t9}`);

// task 10 : Визначити кількість його парних дільників.
let t10 = [];
let t10arr = t9.split(' ');
t10arr.pop();

for (let i = 0; i < t10arr.length; i++) {
  if (t10arr[i] % 2 == 0) t10.push(t10arr[i]);
}
alert(`task 10: Визначити кількість його парних дільників.
${t10.length}`);

// task 11 : Знайти суму його парних дільників.
let t11 = t10.reduce((acc, item) => (acc += +item), 0);
alert(`task 11: Знайти суму його парних дільників
${t11}`);

// task 12 : Надрукувати повну таблицю множення від 1 до 10.

let t12 = '';

for (let i = 1; i < 11; i++) {
  for (let k = 1; k < 10; k++) {
    let mult = k * i;
    t12 += `${k} * ${i} = ${mult}\n`;
  }
  t12 += '\n';
}
console.log(`task 12: Надрукувати повну таблицю множення від 1 до 10.
${t12}`);
